---
type: FreeFormElement
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# FreeFormElement

`Autodesk.Revit.DB.FreeFormElement` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CanOffsetFace | 2014 | `public bool CanOffsetFace ( Face face )` |
| Method | Create | 2014 | `public static FreeFormElement Create ( Document document , Solid geometry )` |
| Method | SetFaceOffset | 2014 | `public void SetFaceOffset ( Face face , double offset )` |
| Method | UpdateSolidGeometry | 2015 | `public void UpdateSolidGeometry ( Solid newGeometry )` |
| Property | Parameter | — | `` |